# Pandas

In [3]:
import pandas as pd

In [15]:
dic = {'Nombre': ['Alex', 'Roger', 'Rafa', 'Adrian', None], 'Edad': [30, 29, 28, 31, 30]}
lista = pd.DataFrame(dic)
lista

   Nombre  Edad
0    Alex    30
1   Roger    29
2    Rafa    28
3  Adrian    31
4    None    30

In [23]:
type(lista)

pandas.core.frame.DataFrame

In [25]:
type(lista['Nombre']) # las columnas se les llama series

pandas.core.series.Series

In [26]:
lista['Nombre'], lista['Edad']

(0      Alex
 1     Roger
 2      Rafa
 3    Adrian
 4      None
 Name: Nombre, dtype: object,
 0    30
 1    29
 2    28
 3    31
 4    30
 Name: Edad, dtype: int64)

In [31]:
lista['Nombre'][1:]

1     Roger
2      Rafa
3    Adrian
4      None
Name: Nombre, dtype: object

In [32]:
lista['Edad'][2]

np.int64(28)